#!/data/data/com.termux/files/usr/bin/bash

# Проверка и удаление уже запущеного процесса termux.x11
########################################################
name="termux.x11"
echo "поиск на удаление процесса $name"
pids=$(pgrep -f "$name")
if [ -n "$pids" ]; then
    kill $pids
    echo "процесс $name ($pids) удален"
else
    echo "процесс не найден"
fi
########################################################
sleep 1

# Удаление процесса pylseaudio
########################################################
echo "удаление процесса PULSEAUDIO"
pkill -f pulseaudio
########################################################
sleep 1

########################################################
echo "по новой запускаем процесс PULSEAUDIO"
pulseaudio \
  --daemonize=no \
  --system=no \
  --fail \
  --disallow-exit \
  --start \
  --load="module-native-protocol-tcp auth-ip-acl=127.0.0.1 auth-anonymous=1" \
  --exit-idle-time=-1
########################################################
sleep 1

########################################################
# Устанавить переменную окружения, указывающую на
# временную директорию, что необходимо для работы X-сервера.
export XDG_RUNTIME_DIR=${TMPDIR}
# Запустить X-сервер в фоновом режиме, перенаправляя вывод
# в /dev/null, чтобы не отображать его в терминале.
echo "запуск X-сервера"
termux-x11 :1 >x11.log &
########################################################
sleep 1

########################################################
echo "запуск окна termux.x11"
am start --user 0 -n com.termux.x11/com.termux.x11.MainActivity > /dev/null 2>&1
########################################################
sleep 1

########################################################
# Запуск dbus, если он не запущен
if ! pgrep -x "dbus-daemon" > /dev/null; then
    echo "Запускаем dbus-daemon"
    dbus-daemon --session --print-address > /dev/null 2>&1 &
    sleep 1
fi

########################################################
# Вход и запуск сессии XFCE4 с dbus
echo "вход и запуск сессии"
env DISPLAY=:1 dbus-launch --exit-with-session xfce4-session
########################################################

exit 0
